app/controllers/projects_controller.rb

  def create
    @project = Project.new(project_params)

    respond_to do |format|
      if @project.save
---
INSERT INTO "projects" ("title", "description", "link", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Project"], ["description", "Project"], ["link", "https://startbootstrap.com/theme/agency"], ["created_at", "2021-12-01 02:51:03.345005"], ["updated_at", "2021-12-01 02:51:03.345005"]]

  def update
    respond_to do |format|
      if @project.update(project_params)
---
UPDATE "projects" SET "title" = ?, "description" = ?, "link" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["title", "Projects"], ["description", "Projects"], ["link", "https://startbootstrap.com/theme/agencys"], ["updated_at", "2021-12-01 03:18:42.960893"], ["id", 1]]